Revit 2027 API
CableSize.GetCableSizeIdByName Method
 Gets the Cable Size id by given Cable Size name.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId GetCableSizeIdByName(
	Document document,
	string name
)
Public Shared Function GetCableSizeIdByName (
	document As Document,
	name As String
) As ElementId
public:
static ElementId^ GetCableSizeIdByName(
	Document^ document,
	String^ name
)
static member GetCableSizeIdByName :
        document : Document *
        name : string -> ElementId
Parameters
document Document
 The document.
name String
 The Cable Size name.
Return Value
ElementId
 The Cable Size id.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- name is an empty string.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
See Also
Reference
CableSize Class
Autodesk.Revit.DB.Electrical Namespace